# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:3
#+LANGUAGE: en-us
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <style>blockquote p:last-child, div.figure p {margin: 0;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[document]{ragged2e}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \titleformat*{\section}{\LARGE\bfseries}
#+LATEX_HEADER: \titleformat*{\subsection}{\Large\bfseries}
#+LATEX_HEADER: \titleformat*{\subsubsection}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\paragraph}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\subparagraph}{\large\bfseries}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.2}
#+LATEX_HEADER: \definecolor{light_grey}{RGB}{51,51,51}
#+LATEX_HEADER: \definecolor{bright_grey}{RGB}{249,249,249}
#+LATEX_HEADER: \definecolor{python_blue}{RGB}{41,128,185}
#+LATEX_HEADER: \hypersetup{colorlinks=true, urlcolor=python_blue, linkcolor=python_blue, citecolor=red}
#+LATEX_HEADER: \tolerance=1
#+LATEX_HEADER: \emergencystretch=\maxdimen
#+LATEX_HEADER: \hyphenpenalty=10000
#+LATEX_HEADER: \hbadness=10000
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:   xleftmargin=0.5cm,frame=tlbr,framesep=4pt,framerule=0pt,
#+LATEX_HEADER:   columns=fullflexible,
#+LATEX_HEADER:   backgroundcolor=\color{white},
#+LATEX_HEADER:   basicstyle=\footnotesize\ttfamily,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   frame=single,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   rulecolor=\color{black},
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   stepnumber=2,
#+LATEX_HEADER:   tabsize=2,
#+LATEX_HEADER: }
#+LATEX_HEADER: \DeclareUnicodeCharacter{202F}{ }
#+LATEX: \frenchspacing
#+LATEX: \raggedright
#+TITLE: Guide: estimate heritability of disorder stratified by year of birth
#+AUTHOR: Richard Zetterberg <richard.zetterberg@regionh.dk>
#+PROPERTY: header-args:R :session *R* :tangle yes :shebang "#!/usr/bin/env Rscript"

#+LATEX: \clearpage

#+BEGIN_SRC R :exports none :tangle no
devtools::load_all(".")
source("./tests/utils.R")
#+END_SRC

#+RESULTS:

This is a guide for making the method in [[./guide.org]["estimate heritability of disorder"]] more robust
by adding year of birth stratification.

All code shown in this guide have been written to [[./guide-yob.R][this R file]], so that you don't have
to copy all code snippets manually.

We'll use all the same arguments and code as the previous guide, but we will start changing
the guide at the part where we produce the risk estimates.

We start by importing all the needed libraries:

#+BEGIN_SRC R :exports code :eval no
library(data.table)
library(dplyr)
library(dtplyr)
library(readr)
library(epimight)
#+END_SRC

#+BEGIN_SRC R :exports none
study_period_start <- as.Date("1981-01-01")
study_period_end   <- as.Date("2016-12-31")

icd_codes_regexp <- "^F20|^295[^7]9"
earliest_onset_age <- 10

born_at_start <- as.Date("1981-01-01")
born_at_end   <- as.Date("1996-01-01")

relationship_kind <- "FS"
#+END_SRC

#+RESULTS:
: FS

#+BEGIN_SRC R :eval no :exports code
tte <- read_csv("./tte_SCZ_FS.csv") |> as.data.table()
#+END_SRC

#+BEGIN_SRC R :exports results :results output :tangle no
set.seed(6)
n_count <- 100000

tte <- generate_random_tte(n_count)
tte <- generate_failure(tte, 20, 10)
tte <- generate_relatives_diagnosed(tte, "relatives_diagnosed") |>
  select(-born_at_year, -dead_at_year) |>
  relocate(relatives, .after = failure_time) |>
  as.data.table()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output
tte <- tte |>
  filter(
    born_at >= born_at_start,
    born_at <= born_at_end
  )
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output
print(tte)
#+END_SRC

#+RESULTS:
#+begin_example
       person_id gender    born_at failure_status failure_time relatives
    1:         4      f 1986-03-12              0           40         1
    2:         5      f 1990-10-10              0           36         2
    3:         9      m 1993-11-17              0           33         3
    4:        12      f 1992-04-02              0           34         6
    5:        33      m 1993-10-30              0           33         1
   ---
19804:     99977      f 1993-05-12              1           24         7
19805:     99981      f 1989-11-17              0           37         2
19806:     99982      m 1981-04-06              0           45         3
19807:     99984      f 1985-11-06              0           41         1
19808:    100000      f 1987-04-11              0           39         1
       relatives_diagnosed
    1:                   0
    2:                   0
    3:                   2
    4:                   2
    5:                   0
   ---
19804:                   7
19805:                   0
19806:                   1
19807:                   0
19808:                   0
#+end_example

* Analysis

** Risk estimates

#+BEGIN_SRC R :exports none
cif_analysis <- CumulativeIncidenceAnalysis$new()
#+END_SRC

#+RESULTS:

In this updated version of the pipeline, we are going to use the same two cohorts
as the original version:

1. All individuals
2. Individuals with at least 1 affected relative

In the original version of the pipeline, the results looked something like this:

#+BEGIN_EXAMPLE
    time   estimate     variance        l95        u95 cases             cohort
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives
 2:   11 0.06229293 2.451218e-04 0.03160702 0.09297885     2 affected_relatives
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all
28:   11 0.02250389 2.371205e-05 0.01295984 0.03204794     3                all
#+END_EXAMPLE

Where you have risk estimates separated on the two cohorts. In this updated version,
the results will look something like this:

#+BEGIN_EXAMPLE
    time   estimate     variance        l95        u95 cases             cohort  born_at_year
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1960
 2:   11 0.06229293 2.451218e-04 0.03160702 0.09297885     2 affected_relatives          1960
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1960
28:   11 0.02250389 2.371205e-05 0.01295984 0.03204794     3                all          1960
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1961
 3:   12 0.06696774 2.645270e-04 0.03509033 0.09884516     3 affected_relatives          1961
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1961
29:   12 0.02497864 2.664947e-05 0.01486069 0.03509659     4                all          1961
 1:   10 0.05769079 2.261547e-04 0.02821599 0.08716559     1 affected_relatives          1962
 3:   12 0.06696774 2.645270e-04 0.03509033 0.09884516     3 affected_relatives          1962
27:   10 0.02128324 2.227802e-05 0.01203229 0.03053419     1                all          1962
29:   12 0.02497864 2.664947e-05 0.01486069 0.03509659     4                all          1962
#+END_EXAMPLE

Where you have risk estimates separated on the two cohorts and the year of birth.

To pull that of, we simply add a new column that contains the year of birth:

#+BEGIN_SRC R :exports code :results output
tte <- tte |>
  mutate(
    born_at_year = as.character(format(born_at, "%Y"))
  )
#+END_SRC

#+RESULTS:

And then like before, we create the two cohorts:

#+BEGIN_SRC R :exports code :results output
tte <- tte |>
  mutate(cohort = "all") |>
  union_all(
    tte |>
      filter(relatives_diagnosed > 0) |>
      mutate(cohort = "affected_relatives")
  )
#+END_SRC

#+RESULTS:

Now the survival data have the same amount of rows as before, but with one extra column added:

#+BEGIN_SRC R :exports both :results output
print(tte)
#+END_SRC

#+RESULTS:
#+begin_example
       person_id gender    born_at failure_status failure_time relatives
    1:         4      f 1986-03-12              0           40         4
    2:         5      f 1990-10-10              0           36         1
    3:         9      m 1993-11-17              0           33         4
    4:        12      f 1992-04-02              0           34         3
    5:        33      m 1993-10-30              0           33         4
   ---
24320:     99957      f 1989-02-09              0           37         3
24321:     99960      f 1988-02-10              0           38         2
24322:     99964      m 1993-02-02              0           33         3
24323:     99965      f 1995-10-27              0           31         4
24324:     99990      m 1981-08-04              0           45         3
       relatives_diagnosed born_at_year             cohort
    1:                   0         1986                all
    2:                   1         1990                all
    3:                   0         1993                all
    4:                   0         1992                all
    5:                   0         1993                all
   ---
24320:                   3         1989 affected_relatives
24321:                   1         1988 affected_relatives
24322:                   3         1993 affected_relatives
24323:                   1         1995 affected_relatives
24324:                   3         1981 affected_relatives
#+end_example

Now when we run the analysis, we supply *both* the ~affected_relatives~ column and the
~born_at_year~ column:

#+BEGIN_SRC R :exports code :results output
estimates <- cif_analysis$run(
  tte = tte,
  earliest_onset_age = earliest_onset_age,
  stratify_columns = list("born_at_year", "cohort")
)
#+END_SRC

#+RESULTS:

Now, you'll see that the estimates are grouped on all the possible permutations of the
two columns:

#+BEGIN_SRC R :exports both :results output
print(estimates)
#+END_SRC

#+RESULTS:
#+begin_example
     time         cif          se           l95         u95          var cases born_at_year
  1:    3 0.003344482 0.003344482 -0.0032105819 0.009899545 1.118556e-05     1         1981
  2:    4 0.006688963 0.004721882 -0.0025657554 0.015943682 2.229617e-05     3         1981
  3:    6 0.013377926 0.006655256  0.0003338644 0.026421988 4.429243e-05     5         1981
  4:    7 0.020066890 0.008123356  0.0041454042 0.035988375 6.598891e-05     6         1981
  5:    8 0.023411371 0.008759270  0.0062435183 0.040579224 7.672480e-05     8         1981
 ---
936:   27 0.075688073 0.007316302  0.0613483859 0.090027761 5.352827e-05   101         1995
937:   28 0.078746177 0.007450292  0.0641438736 0.093348481 5.550685e-05   107         1995
938:   29 0.083333333 0.007645122  0.0683491689 0.098317498 5.844790e-05   108         1995
939:   30 0.084097859 0.007676910  0.0690513929 0.099144326 5.893494e-05   110         1995
940:   31 0.085626911 0.007739919  0.0704569481 0.100796875 5.990635e-05   130         1995
                 cohort
  1: affected_relatives
  2: affected_relatives
  3: affected_relatives
  4: affected_relatives
  5: affected_relatives
 ---
936:                all
937:                all
938:                all
939:                all
940:                all
#+end_example

** Heritability

After producing the risk estimates, we can calculate the heritability.
To do that we need a dataset that contains the last risk estimate
(highest value of ~time~ column) for each year of birth, that exists
in both cohorts:

#+BEGIN_SRC R :exports both :results output
cohort1 <- estimates |> filter(cohort == "all")
cohort2 <- estimates |> filter(cohort == "affected_relatives")
#+END_SRC

#+RESULTS:

Then to make sure we only use risk estimates that exists in both cohorts, we
join the two cohorts using an inner join. An inner join will only keep rows that
have matches in both datasets, all other rows are removed. Since the results are
stratified by year of birth, we need to make sure the risk estimates exists in both
cohorts, for all years:

#+BEGIN_SRC R :exports both :results output
combined <- cohort1 |>
  inner_join(cohort2, by = join_by(time, born_at_year)) |>
  rename(
    c1_cif       = cif.x,
    c1_cif_cases = cases.x,
    c2_cif       = cif.y,
    c2_cif_cases = cases.y
  ) |>
  select(time, born_at_year, c1_cif, c1_cif_cases, c2_cif, c2_cif_cases)
#+END_SRC

#+RESULTS:

Now we have a combined dataset where each row represents risk estimates from both cohorts.
Since we are only interested in the last risk estimate in each year of birth, we need to
sort the risk estimates so that the last risk estimate is first and then pick the first
risk estimate per year of birth:

#+BEGIN_SRC R :exports both :results output
combined <- combined |>
  group_by(born_at_year) |>
  arrange(desc(time)) |>
  filter(row_number() == 1) |>
  as.data.table()
#+END_SRC

#+RESULTS:

If we order the dataset by year of birth, we can see that we have the latest
risk estimate for each year with the estimates and amount of cases for
both cohorts:

#+BEGIN_SRC R :exports both :results output
print(combined |> arrange(born_at_year))
#+END_SRC

#+RESULTS:
#+begin_example
    time born_at_year     c1_cif c1_cif_cases    c2_cif c2_cif_cases
 1:   45         1981 0.09252120          119 0.1872910           55
 2:   44         1982 0.09954407          128 0.1666667           51
 3:   43         1983 0.09628506          123 0.1557093           44
 4:   42         1984 0.10576222          146 0.1907692           63
 5:   41         1985 0.08275329          108 0.1578947           48
 6:   40         1986 0.10424710          131 0.1716172           50
 7:   39         1987 0.10510733          142 0.2056962           68
 8:   38         1988 0.08618128          117 0.1634615           51
 9:   37         1989 0.09450549          134 0.2255892           68
10:   36         1990 0.10158014          136 0.2032787           62
11:   35         1991 0.09274495          136 0.1846690           57
12:   34         1992 0.09341501          129 0.2229730           67
13:   33         1993 0.09357653          133 0.1818182           60
14:   32         1994 0.09160305          130 0.1713287           52
15:   31         1995 0.08562691          130 0.1967213           68
#+end_example

Now we can simply run the heritability calculation by passing in the the estimate and
cases columns from the combined dataset along with the relationship kind:

#+BEGIN_SRC R :exports both :results output
h2_analysis <- HeritabilityAnalysis$new()

h2_estimates <- h2_analysis$run(
  relationship_kind = relationship_kind,
  estimates         = combined
) |> select(time, born_at_year, h2, se, l95, u95) # We don't need the risk estimate columns
#+END_SRC

#+RESULTS:

And here's what the results look like:

#+BEGIN_SRC R :exports both :results output
print(h2_estimates)
#+END_SRC

#+RESULTS:
#+begin_example
    time born_at_year        h2         se       l95       u95
 1:   45         1981 0.5163613 0.10368868 0.3131315 0.7195911
 2:   44         1982 0.3768777 0.10732707 0.1665167 0.5872388
 3:   43         1983 0.3420142 0.11204020 0.1224154 0.5616130
 4:   42         1984 0.4551008 0.10132908 0.2564958 0.6537058
 5:   41         1985 0.4385638 0.10398391 0.2347553 0.6423722
 6:   40         1986 0.3730800 0.11026176 0.1569670 0.5891931
 7:   39         1987 0.5260970 0.09926756 0.3315325 0.7206614
 8:   38         1988 0.4437412 0.10257173 0.2427006 0.6447818
 9:   37         1989 0.6691666 0.09741995 0.4782235 0.8601097
10:   36         1990 0.5352396 0.10206279 0.3351965 0.7352826
11:   35         1991 0.5030909 0.10091145 0.3053045 0.7008773
12:   34         1992 0.6645577 0.09773498 0.4729972 0.8561183
13:   33         1993 0.4850061 0.09904147 0.2908848 0.6791274
14:   32         1994 0.4477390 0.10364442 0.2445960 0.6508821
15:   31         1995 0.5993152 0.09242238 0.4181674 0.7804631
#+end_example

Since the results are stratified by year of birth, we need to run a meta
analysis to get a single value:

#+BEGIN_SRC R :exports both :results output
meta <- h2_analysis$run_meta(
  estimates       = h2_estimates,
  estimate_column = "h2",
  se_column       = "se"
)

print(meta)
#+END_SRC

#+RESULTS:
: fixed_meta   fixed_se fixed_l95 fixed_u95 rand_meta    rand_se  rand_l95  rand_u95
: 1:  0.4993258 0.02631116  0.447756 0.5508957 0.4957042 0.03657211 0.4240229 0.5673855

There are actually two results one for the fixed effects model and one for the random effects model.

The next logical step is to use the [[../genetic-correlation/guide.org][estimate genetic correlation between two disorders]]-pipeline,
since that pipeline builds upon the results of this pipeline.
